rauction-app/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
---
  def index
    @auctions = Auction.all