rauction-app/app/controllers/auctions_controller.rb

  def index
    @auctions = Auction.where(user_id: params[:user_id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."user_id" = ?  [["user_id", 1]]

  def create
    @auction = Auction.new(auction_params)
    @auction.user = current_user
    if @auction.save
---
INSERT INTO "auctions" ("title", "make", "model", "address", "color", "features", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["make", ""], ["model", ""], ["address", ""], ["color", ""], ["features", ""], ["user_id", 1], ["created_at", 2016-11-28 04:30:16 UTC], ["updated_at", 2016-11-28 04:30:16 UTC]]

  def show
    @auction = Auction.find(params[:id])
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @auction = Auction.find(params[:id])
    @auction.destroy
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "auctions" WHERE "auctions"."id" = ?  [["id", 1]]