rauction-app/app/controllers/dealers_controller.rb

INSERT INTO "dealers" ("company_name", "dealer_name", "address", "email", "created_at", "updated_at", "latitude", "longitude", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @dealer = Dealer.new(dealer_params)
     if @dealer.save