rauction-app/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "vanessa@email.com"], ["LIMIT", 1]]
SELECT  "dealers".* FROM "dealers" WHERE "dealers"."email" = ? LIMIT ?  [["email", "vanessa@email.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by_email(params[:email])
    dealer = Dealer.find_by_email(params[:email])